tutorials/lagrangian/reactingParcelFilmFoam/rivuletPanel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       85980;
    }
    outlet
    {
        type            patch;
        nFaces          180;
        startFace       86100;
    }
    sides
    {
        type            patch;
        nFaces          43740;
        startFace       86280;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            directMappedWall;
        nFaces          43200;
        startFace       130020;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets
43200
(
(-6.938893904e-18 -0 -0)
(-0 -0 -0)
(-0 -1.110223025e-16 -0)
(-6.938893904e-18 -0 -0)
(-0 -0 -0)
(-0 -1.110223025e-16 -0)
(-6.938893904e-18 -0 -0)
(-0 -0 -2.220446049e-16)
(-0 -0 -0)
(-1.387778781e-17 -0 -0)
(-0 1.110223025e-16 -0)
(-0 -1.110223025e-16 -0)
(-6.938893904e-18 -0 -0)
(-0 -0 -2.220446049e-16)
(6.938893904e-18 1.110223025e-16 2.220446049e-16)
(-6.938893904e-18 -0 -0)
(-0 -0 -0)
(-0 1.110223025e-16 -0)
(-6.938893904e-18 -0 -0)
(-0 -1.110223025e-16 -0)
(-0 -1.110223025e-16 -0)
(-6.938893904e-18 -1.110223025e-16 -0)
(-0 -0 -2.220446049e-16)
(-0 -0 -0)
(-1.387778781e-17 -1.110223025e-16 -0)
(-0 2.220446049e-16 -0)
(-0 -0 -0)
(-6.938893904e-18 -0 -0)
(-0 -0 -2.220446049e-16)
(6.938893904e-18 1.110223025e-16 2.220446049e-16)
(-6.938893904e-18 -0 -0)
(-0 -0 -0)
(-0 -1.110223025e-16 -0)
(-6.938893904e-18 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
(-6.938893904e-18 -1.110223025e-16 -0)
(-0 -2.220446049e-16 -2.220446049e-16)
(-0 -1.110223025e-16 -0)
(-1.387778781e-17 -0 -0)
(-0 1.110223025e-16 -0)
(-0 -0 -0)
(-6.938893904e-18 -0 -0)
(-0 -2.220446049e-16 -2.220446049e-16)
(6.938893904e-18 2.220446049e-16 2.220446049e-16)
(-6.938893904e-18 -0 -0)
(-0 -1.110223025e-16 -0)
(-0 -1.110223025e-16 -0)
(-6.938893904e-18 -2.220446049e-16 -0)
(-0 -0 -0)
(-0 -0 -0)
(-6.938893904e-18 -3.330669074e-16 -0)
(-0 -1.110223025e-16 -2.220446049e-16)
(-0 -1.110223025e-16 -0)
(-1.387778781e-17 -0 -0)
(-0 -1.110223025e-16 -0)
(-0 -0 -0)
(-6.938893904e-18 -1.734723476e-18 -4.440892099e-16)
(-0 -0 -0)
(-1.387778781e-17 -0 -0)
(-0 -0 -0)
(-0 3.469446952e-18 -0)
(-1.387778781e-17 -3.469446952e-18 -0)
(-0 -0 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-1.387778781e-17 1.387778781e-17 -0)
(-0 -0 -2.220446049e-16)
(-0 -0 1.110223025e-16)
(-1.387778781e-17 -0 -0)
(-0 -0 -0)
(-1.387778781e-17 -6.938893904e-18 -2.220446049e-16)
(-0 -0 1.110223025e-16)
(-0 -0 -0)
(-0 -2.775557562e-17 -0)
(-0 -0 -2.220446049e-16)
(-0 -1.387778781e-17 -0)
(-0 -0 -0)
(-0 -1.387778781e-17 -0)
(6.938893904e-18 1.387778781e-17 -0)
(-0 1.387778781e-17 -2.220446049e-16)
(6.938893904e-18 -0 -0)
(-1.387778781e-17 -1.387778781e-17 -2.220446049e-16)
(-0 -0 -0)
(-0 -0 -0)
(6.938893904e-18 -1.387778781e-17 -0)
(-0 -2.775557562e-17 -0)
(6.938893904e-18 -2.775557562e-17 -0)
(-1.387778781e-17 -2.775557562e-17 -4.440892099e-16)
(-0 -2.775557562e-17 -4.440892099e-16)
(6.938893904e-18 -2.775557562e-17 -0)
(-1.387778781e-17 -2.775557562e-17 -4.440892099e-16)
(6.938893904e-18 -0 -0)
(-0 -0 -4.440892099e-16)
(-6.938893904e-18 -0 -0)
(-0 -5.551115123e-17 -4.440892099e-16)
(6.938893904e-18 2.775557562e-17 -0)
(-1.387778781e-17 -2.775557562e-17 -4.440892099e-16)
(6.938893904e-18 2.775557562e-17 -0)
...
)
;
    }
)

// ************************************************************************* //
